Revit 2024 API
FabricationPartBrowserChangedEventArgs.Operation Property
 The operation associated with this event
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public FabricationPartBrowserOperation Operation { get; }
Visual Basic
Public ReadOnly Property Operation As FabricationPartBrowserOperation
	Get
Visual C++
public:
property FabricationPartBrowserOperation Operation {
	FabricationPartBrowserOperation get ();
}
See Also
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace